Compterendu.org



* Config latex                                                       :ignore:

#+LANGUAGE:french
#+OPTIONS: toc:nil %pour ne pas afficher la tdm avant la page de garde


#+SETUPFILE:Latex/Setupfile/Styleslatex/org-plain-latex.org


#+SETUPFILE:Latex/Setupfile/Pagedegarde/Pagedegarde1/pourpagedegarde1.org



#+Latex_header:\usepackage{lastpage} %les latex header ici



#+BEGIN_EXPORT latex
%chargement de la page de garde
\input{$PWD/Latex/Setupfile/Pagedegarde/Pagedegarde1/pagedegarde1.org}
#+END_EXPORT




#+TOC: headlines 2 % afficher tdm ici, nombre de "sous titre", 3= va jusqu'à titre 3

* Newpage :ignore:
\newpage

* Rappel rapide des méthodes


** Cas général des méthodes

Pour les deux méthodes, le but est le même, trouver une équation avec un nombre de points $n+1$ de la forme :


\[ P(x)= a_0 + a_1x + a_2x^2 + … + a_nx^n  \]




** Méthode de Lagrange




La méthode de Lagrange se base sur la formule suivante :

\[ L(x)=\sum _{i=0}^{n}y_{i}\left(\prod _{i=0,i\neq j}^{n}{\frac {x-x_{j}}{x_{i}-x_{j}}}\right) \]

Que l'on peut aussi écrire sous cette forme :

\[ L(X)=\sum _{i=0}^{n}y_{i}l_{i}(X)} \]

Avec $li$ définie tel que :

\[li = \prod _{i=0,i\neq j}^{n}{\frac {x-x_{j}}{x_{i}-x_{j}}}\right \]



** Méthode de Newton


Pour la méthode de newton, nous devons appliquer cette formule :

\[   N(x)=\sum _{i=0}^{k}a_{i}n_{i}(x)}\]

Où $n$ sont les polynômes de Newton définis de la manière
suivante :

\[ n_{i}(x)=\prod _{0\leq j < i}(x-x_{j})\qquad i=0,\ldots ,n  \]

et $a_i$ les différences divisées définit tel que




#+begin_export latex
\begin{align*}
a_0 &= y_1 \\
    a_1 &= \frac{y_2 - y_1}{x_2 - x_1}\\
    ...\\
    a_k &= \nabla^{k}y_{k+1}\\
    ...\\
    a_{n-1} &= \nabla^{n-1}y_{n}
\end{align*}
#+end_export

#+begin_center
Avec pour $j > i$ ,$\nabla^k y_j = \frac{\nabla^{k-1} y_j - \nabla^{k-1}y_{k}}{x_j - x_{k}}$
#+end_center


Conclusion : Nous devons effectuer cette formule :

\[  N(x)=[y_{0}]+[y_{0},y_{1}](x-x_{0})+\ldots +[y_{0},\ldots ,y_{n}](x-x_{0})\ldots (x-x_{n}).}  \]

* Présentation des programmes commentés

Nous ne mettrons pas l'intégralité du code des différentes résolutions, mais ils sont consultables [[file:lagrange.c][ici pour la méthode de Lagrange]], ainsi qu'[[file:newton.c][ici pour la méthode Newton]].

** Nos structures

Nous avons choisis d'utiliser plusieurs structures pour plusieurs cas :
1. La première, la structure /point/, qui est utilisé partout. En effet, cette structure nous permet de stocker les différents points qui nous sont nécessaire pour trouver un polynôme respectant l'interpolation.
2. Puis, la structure /Maillon/. Cette structure est essentielle pour une chose : former des listes, ce qui nous permet d'ajouter un nombre de points indéfinis au départ, puis d'en rajouter, supprimer, etc, sans perdre de la mémoire.
3. La structure /Liste/, qui est la suite logique de structure /Maillon/.
4. La structure polynôme : celle-ci est particulière, une partie lui est entièrement consacré dans la suite du document.
5. Enfin, même si ce n'est pas vraiment une structure, une fonction s'appelant /transformefloatenpoly/ transforme une liste de points en un tableau, permettant alors d'y accéder plus rapidement et facilement.

*** Listes/Points

Le code pour les listes ainsi que pour les points est trouvable [[file:listePoint.c][ici]].

Pour former un point, nous avons tout simplement besoin d'un x et d'un y associé à celui-ci.
La structure des points est donc la suivante :

#+begin_src C
    
  typedef struct point
  {
    float x;
    float y;
  } point;
    
#+end_src

Puis, nous voulons rassembler ses points en des listes, nous avons donc besoin de deux structures supplémentaires : la structure /Maillon/ et la struture /Liste/. Ces deux structures permettent de structurer nos données, les utiliser, et les afficher dans des graphiques.

#+begin_src C
    
  typedef struct Maillon{
    struct Maillon *suiv;
    point val;
  }Maillon;
    
  typedef struct Liste{
    struct Maillon *first;
  }Liste;
    
    
#+end_src

De plus, les fonctions usuelles des listes sont également créé :
1. /creerListe/
2. /detruireListe/
3. ajouteDebut
4. ajouteFin
5. /afficheListePoints/
6. ListLenght
7. supprDebut
8. supprFin
9. supprValeur
10. supprMaillon
11. ListeToTabsPoints, qui transforme une liste en un tableau.
12. ViderListe
   


*** Polynômes

Le code pour les polynôme est trouvable [[file:polynome.c][ici]]. 

Comme vous le savez, le C n'inclue pas de type "polynôme". Nous avons donc dû creer la structure suivante :

#+begin_src C
  
  typedef struct Polynome{
    float *p;
    int maxDeg;
  }polynome;
  
#+end_src

Cette structure à pour but de prendre un tableau, où l'indice du tableau nous permet de trouver le degrès de x, et les valeurs stockés dans le tableau sont les différents coefficients pour chaque x du polynôme.

Nous avons également fait les diverses fonctions de bases :
1. /polynome *creePolynome(int maxDeg)/, qui nous permet de créer un pointeur sur un polynôme.
2. void destroyPolynome(polynome *p), qui supprime un polynôme.
3. void affichepolynome(polynome *p), comme son nom l'indique, affiche le polynôme passé en paramètre.
4. polynome *transformefloatenpoly(float unfloat), qui convertie un flottant en un polynôme.
5. polynome *addPolynome(polynome *p1, polynome *p2), qui nous permet d'additionner (et dans le même temps de soustraire) deux polynôme entre eux

   #+begin_src C
     
     int i;
     polynome *poly =
       creePolynome((p1->maxDeg > p2->maxDeg) ? p1->maxDeg : p2->maxDeg);
     
     for (i = 0; i < p1->maxDeg + 1; ++i)
       {
	 /* printf("Degrèse de p1 %d \n", p1->maxDeg); */
	 poly->p[i] = p1->p[i];
       }
     
     for (i = 0; i < p2->maxDeg + 1; ++i)
       {
	 poly->p[i] += p2->p[i];
       }
     destroyPolynome(p1);
     destroyPolynome(p2);
     return poly;
     
   #+end_src
6. polynome *multPolynome(polynome *p1, polynome *p2). Cette fonction multiplie deux polynômes entre eux.

   #+begin_src C
     
     
     int i, j;
     polynome *poly = creePolynome(p1->maxDeg + p2->maxDeg);
     
     for (i = 0; i < p1->maxDeg + 1; ++i)
       {
	 for (j = 0; j < p2->maxDeg + 1; ++j)
	   {
	     poly->p[i + j] += p1->p[i] * p2->p[j];
	   }
       }
     destroyPolynome(p1);
     destroyPolynome(p2);
     return poly;
     
   #+end_src






** Présentation de la méthode de Lagrange

Pour aborder ce problème, nous avons décidé d'aborder ce problème en deux étapes : 
1. D'abord, calculer Li, avec une fonction /calculLi/
2. Puis, grâce à la fonction /calculLi/ que l'on appelle dans la fonction /calculLagrange/, on renvoie le polynôme correspondant à l'interpolation.

