Compterendu.tex
% Created 2021-10-22 Fri 09:12
% Intended LaTeX compiler: pdflatex
\documentclass[letter]{article}
                      \usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry}
\usepackage[frenchb, ]{babel}
\usepackage{libertine}
\usepackage[pdftex]{graphicx}
\setlength{\parskip}{1ex plus 0.5ex minus 0.2ex}
\newcommand{\hsp}{\hspace{20pt}}
\newcommand{\HRule}{\rule{\linewidth}{0.5mm}}
\usepackage{lastpage} %les latex header ici
\date{\today}
\title{}
\begin{document}

%chargement de la page de garde
\input{$PWD/Latex/Setupfile/Pagedegarde/Pagedegarde1/pagedegarde1.org}




\setcounter{tocdepth}{2}
\tableofcontents

\newpage

\section{Rappel rapide des méthodes}
\label{sec:org0fd6323}


\subsection{Cas général des méthodes}
\label{sec:org8be7e0e}

Pour les deux méthodes, le but est le même, trouver une équation avec un nombre de points \(n+1\) de la forme :


\[ P(x)= a_0 + a_1x + a_2x^2 + … + a_nx^n  \]




\subsection{Méthode de Lagrange}
\label{sec:org1f0de7a}




La méthode de Lagrange se base sur la formule suivante :

\[ L(x)=\sum _{i=0}^{n}y_{i}\left(\prod _{i=0,i\neq j}^{n}{\frac {x-x_{j}}{x_{i}-x_{j}}}\right) \]

Que l'on peut aussi écrire sous cette forme :

\[ L(X)=\sum _{i=0}^{n}y_{i}l_{i}(X)} \]

Avec \(li\) définie tel que :

\[li = \prod _{i=0,i\neq j}^{n}{\frac {x-x_{j}}{x_{i}-x_{j}}}\right \]



\subsection{Méthode de Newton}
\label{sec:orgaa25be4}


Pour la méthode de newton, nous devons appliquer cette formule :

\[   N(x)=\sum _{i=0}^{k}a_{i}n_{i}(x)}\]

Où \(n\) sont les polynômes de Newton définis de la manière
suivante :

\[ n_{i}(x)=\prod _{0\leq j < i}(x-x_{j})\qquad i=0,\ldots ,n  \]

et \(a_i\) les différences divisées définit tel que




\begin{align*}
a_0 &= y_1 \\
    a_1 &= \frac{y_2 - y_1}{x_2 - x_1}\\
    ...\\
    a_k &= \nabla^{k}y_{k+1}\\
    ...\\
    a_{n-1} &= \nabla^{n-1}y_{n}
\end{align*}

\begin{center}
Avec pour \(j > i\) ,\(\nabla^k y_j = \frac{\nabla^{k-1} y_j - \nabla^{k-1}y_{k}}{x_j - x_{k}}\)
\end{center}


Conclusion : Nous devons effectuer cette formule :

\[  N(x)=[y_{0}]+[y_{0},y_{1}](x-x_{0})+\ldots +[y_{0},\ldots ,y_{n}](x-x_{0})\ldots (x-x_{n}).}  \]

\section{Présentation des programmes commentés}
\label{sec:orge5bfeda}

Nous ne mettrons pas l'intégralité du code des différentes résolutions, mais ils sont consultables \href{lagrange.c}{ici pour la méthode de Lagrange}, ainsi qu'\href{newton.c}{ici pour la méthode Newton}.

\subsection{Nos structures}
\label{sec:orgd5a25a0}

Nous avons choisis d'utiliser plusieurs structures pour plusieurs cas :
\begin{enumerate}
\item La première, la structure \emph{point}, qui est utilisé partout. En effet, cette structure nous permet de stocker les différents points qui nous sont nécessaire pour trouver un polynôme respectant l'interpolation.
\item Puis, la structure \emph{Maillon}. Cette structure est essentielle pour une chose : former des listes, ce qui nous permet d'ajouter un nombre de points indéfinis au départ, puis d'en rajouter, supprimer, etc, sans perdre de la mémoire.
\item La structure \emph{Liste}, qui est la suite logique de structure \emph{Maillon}.
\item La structure polynôme : celle-ci est particulière, une partie lui est entièrement consacré dans la suite du document.
\item Enfin, même si ce n'est pas vraiment une structure, une fonction s'appelant \emph{transformefloatenpoly} transforme une liste de points en un tableau, permettant alors d'y accéder plus rapidement et facilement.
\end{enumerate}

\subsubsection{Listes/Points}
\label{sec:orgba548d2}

Le code pour les listes ainsi que pour les points est trouvable \href{listePoint.c}{ici}.

Pour former un point, nous avons tout simplement besoin d'un x et d'un y associé à celui-ci.
La structure des points est donc la suivante :

\begin{verbatim}

typedef struct point
{
  float x;
  float y;
} point;

\end{verbatim}

Puis, nous voulons rassembler ses points en des listes, nous avons donc besoin de deux structures supplémentaires : la structure \emph{Maillon} et la struture \emph{Liste}. Ces deux structures permettent de structurer nos données, les utiliser, et les afficher dans des graphiques.

\begin{verbatim}

typedef struct Maillon{
  struct Maillon *suiv;
  point val;
}Maillon;

typedef struct Liste{
  struct Maillon *first;
}Liste;


\end{verbatim}

De plus, les fonctions usuelles des listes sont également créé :
\begin{enumerate}
\item \emph{creerListe}
\item \emph{detruireListe}
\item ajouteDebut
\item ajouteFin
\item \emph{afficheListePoints}
\item ListLenght
\item supprDebut
\item supprFin
\item supprValeur
\item supprMaillon
\item ListeToTabsPoints, qui transforme une liste en un tableau.
\item ViderListe
\end{enumerate}



\subsubsection{Polynômes}
\label{sec:orga2bcf65}

Le code pour les polynôme est trouvable \href{polynome.c}{ici}. 

Comme vous le savez, le C n'inclue pas de type "polynôme". Nous avons donc dû creer la structure suivante :

\begin{verbatim}

typedef struct Polynome{
  float *p;
  int maxDeg;
}polynome;

\end{verbatim}

Cette structure à pour but de prendre un tableau, où l'indice du tableau nous permet de trouver le degrès de x, et les valeurs stockés dans le tableau sont les différents coefficients pour chaque x du polynôme.

Nous avons également fait les diverses fonctions de bases :
\begin{enumerate}
\item \emph{polynome *creePolynome(int maxDeg)}, qui nous permet de créer un pointeur sur un polynôme.
\item void destroyPolynome(polynome *p), qui supprime un polynôme.
\item void affichepolynome(polynome *p), comme son nom l'indique, affiche le polynôme passé en paramètre.
\item polynome *transformefloatenpoly(float unfloat), qui convertie un flottant en un polynôme.
\item polynome *addPolynome(polynome *p1, polynome *p2), qui nous permet d'additionner (et dans le même temps de soustraire) deux polynôme entre eux

\begin{verbatim}

int i;
polynome *poly =
  creePolynome((p1->maxDeg > p2->maxDeg) ? p1->maxDeg : p2->maxDeg);

for (i = 0; i < p1->maxDeg + 1; ++i)
  {
    /* printf("Degrèse de p1 %d \n", p1->maxDeg); */
    poly->p[i] = p1->p[i];
  }

for (i = 0; i < p2->maxDeg + 1; ++i)
  {
    poly->p[i] += p2->p[i];
  }
destroyPolynome(p1);
destroyPolynome(p2);
return poly;

\end{verbatim}
\item polynome *multPolynome(polynome *p1, polynome *p2). Cette fonction multiplie deux polynômes entre eux.

\begin{verbatim}


int i, j;
polynome *poly = creePolynome(p1->maxDeg + p2->maxDeg);

for (i = 0; i < p1->maxDeg + 1; ++i)
  {
    for (j = 0; j < p2->maxDeg + 1; ++j)
      {
	poly->p[i + j] += p1->p[i] * p2->p[j];
      }
  }
destroyPolynome(p1);
destroyPolynome(p2);
return poly;

\end{verbatim}
\end{enumerate}






\subsection{Présentation de la méthode de Lagrange}
\label{sec:org3abb5ed}

Pour aborder ce problème, nous avons décidé d'aborder ce problème en deux étapes : 
\begin{enumerate}
\item D'abord, calculer Li, avec une fonction \emph{calculLi}
\item Puis, grâce à la fonction \emph{calculLi} que l'on appelle dans la fonction \emph{calculLagrange}, on renvoie le polynôme correspondant à l'interpolation.
\end{enumerate}
