Compterendu.tex

\subsubsection{Présentation de la fonction \emph{calculLi}}
\label{sec:org4907342}

Suite à l'initialisation des variables nécessaires, cette fonction permet le calcul de Li, avec  \(i\in [0, 1, ... , k]\).
Les deux principales difficultés sont les suivantes :
\begin{enumerate}
\item Prendre en compte le cas de la division par 0, lorsque \(x_i - x_j = 0\).
\item Réinitialiser x à chaque tour de boucle. En effet, nos fonction renvoie un nouveau pointeur, ce qui supprime x à chaque fois. Nous devons donc le réinitialiser à chaque tour dans la boucle, ce qui nous permet d'enlever la fameuse erreur "segmentation fault" !
\end{enumerate}

\begin{verbatim}

for (i = 0; i < ListLenght(points); ++i)
{
  if (i == numero)
  {
    /* si i = numero, alors il y aurait une division par 0. On ne
       fait donc rien */
  }
  else
  {
    /* Création du polynôme pour les calculs */
    polynome *x = creePolynome(1);
    x->p[1] = 1;

    /* Calcul de la première différence */
    polynome *y = addPolynome(x, transformefloatenpoly(-pointstab[0][i]));

    /* calcul de la multiplication par l'inverse de xnum - xi */
    polynome *tmp = multPolynome(
	y,
	transformefloatenpoly(1 / (pointstab[0][numero] - pointstab[0][i])));

    /* multiplication par le polynôme précédemment calculé */
    Li = multPolynome(Li, tmp);
  }
}

return Li;

\end{verbatim}

\subsubsection{Présentation de la fonction \emph{calculLagrange}}
\label{sec:orge0494b6}

Cette fonction permet de faire la somme des différents Li trouvé dans la fonction \hyperref[sec:org4907342]{\emph{calculLi}}.
En effet, pour compléter la méthode de Lagrange, il faut faire une boucle \emph{for} qui fait une somme des \(y_i\) multiplier par \hyperref[sec:org4907342]{\emph{calculLi}} pour l'itération \(i\).

\begin{verbatim}

  int i;

/* création du polynôme du résultatde l'interpolation  */
polynome *fonction = creePolynome(ListLenght(points));

/* Initialisation d'un tableau à partir d'une liste (accéder au
   valeur plus facilement) */
float **pointstab;
pointstab = ListeToTabsPoints(points);

/* boucle for pour multiplier par yi les Li calculer dans la
   fonction calculLi */
for (i = 0; i < ListLenght(points); ++i)
{
  fonction = addPolynome(fonction,
			 multPolynome(transformefloatenpoly(pointstab[1][i]),
				      calculLi(i, points)));
}

return fonction;

\end{verbatim}

Il ne reste plus qu'à retourner le polynôme trouver pour pouvoir l'afficher ou bien même l'utiliser dans SDL.

\subsection{Présentation de la méthode de Newton}
\label{sec:orgaefcc87}


Le code pour l'interpolation newtonienne est disponible \href{newton.c}{ici.}


Pour la résolution par Newton, nous commençons tout d'abord par initialiser un tableau de la taille adéquate pour nous permettre de stocker les différences divisées.

\begin{verbatim}

long double **triangle = (long double **)malloc(sizeof(long double *) * (pointNB));
for(int i = 0; i < pointNB; i++){
  triangle[i] = (long double *)malloc(sizeof(long double) * (pointNB-i));
}


\end{verbatim}

Puis, nous remplissons la première colonne avec les ordonnées des points.

\begin{verbatim}
for(int i = 0; i < pointNB; i++)  
  {
    triangle[0][i] = Points[1][i];
  }

\end{verbatim}

Subséquemment, nous pouvons effectuer le calcul des différences divisées en appliquant la formule du cours

\begin{verbatim}

for(int i = 1; i < pointNB; i++){
  for(int j = 0; j < pointNB-i; j++){
    triangle[i][j] = (triangle[i-1][j+1] - triangle[i-1][0]) / (Points[0][i+j] - Points[0][i-1]);
  }
 }

\end{verbatim}


Enfin, nous pouvons passer à la résolution résolution finale, qui elle aussi est issue du cours.
\begin{verbatim}

for(int i = 0; i < pointNB-1; i++){
  /* créer le polynome "constant" */
  tmp = creePolynome(2);
  tmp->p[1] = 1;

  /* résolution de la méthode */
  tmp->p[0] = -Points[0][pointNB - 2 - i];
  Solution = multPolynome(Solution, tmp);
  Solution->p[0] += triangle[pointNB-i-2][0];
}
Solution = AdaptePoly(Solution);

\end{verbatim}

Il ne nous reste plus qu'à retourner le polynôme obtenu pour pouvoir l'afficher  dans le terminal, où sous une courbe avec SDL.

\section{Présentation des Jeux d'essais avec commentaires}
\label{sec:org6d4d824}

Les différents résultats sont disponibles en faisant les test grâces au fonctionnalité implémenter dans le programme.


\subsection{Densité de l'eau en fonction de la température de l'air :}
\label{sec:org45bea90}

Liste de points avec une précision de l'ordre de 10\textsuperscript{-5}.
Difficultés potentielles : précisions.



Résultats : Les deux polynômes sont les mêmes et les calculs sont les bons.



\subsection{Les trois séries :}
\label{sec:org2293576}

Suites de points normaux.
Difficultés potentielles : aucune, sauf pour le dernier qui ne pourra sûrement pas être calculé (car ce n'est pas une suite de points avec différents \(x\))


Résultats : 

\begin{enumerate}
\item Le polynôme est le bon, aucune difficulté

\item Le polynôme est le bon, mais des erreurs d'approximations sont présentes. Les polynômes ne sont pas exactement les mêmes.

\item Ne peut pas se calculer : en effet, les points sont sur le même X. L'interpolation est donc incalculable (et infaisable).
\end{enumerate}


\subsection{Dépenses mensuelles et revenus :}
\label{sec:org911003c}

Pour ces données, il y a un grand nombre de données, ainsi qu'un axe des x qui commence avec de "grandes valeurs".

Difficultés potentielles : précisions dû aux résultats importants obtenus.


Résultats :Les polynômes ont soit des coefficients très importants, soit des coefficients presque négligeable. En revanche, on peut constater qu'il y a des approximations de calcul dans les deux méthodes. En effet, les deux polynômes finaux ne sont pas exactement les mêmes, même si ils sont tous les deux du même ordre de grandeur.


\subsection{Commentaire global}
\label{sec:org51ff91d}

Pour ses différents jeux d'essais, on peut constater plusieurs choses :

\begin{enumerate}
\item L'unicité du polynôme obtenu

En effet, ce dernier est souvent le même pour les deux méthodes. Évidemment, des approximations de calcul sont présentes.

\item Influence de la modification d'un ou plusieurs points donnés sur le polynôme :
Lorsque l'on donne des points aléatoires au fur et à mesure grâce à l'implémentation de notre méthode "placer un point" pour mettre un point, on peut voir que les deux polynômes s'adaptent bien.

\item Évaluation des coûts :
Pour Newton, la complexité est de l'ordre (o)n\textsuperscript{2}, tandis que pour Lagrange, elle est de (o)n\textsuperscript{3}. 
Vous pouvez, grâce au programme, afficher les polynômes avec une grande ou une petite précision. Si vous choisissez la méthode précise, vous aurez alors la moyenne des différences avec les points originaux, ce qui nous permet d'avoir une idée précise sur l’efficacité des méthodes.
\end{enumerate}

\newpage
\section{SDL}
\label{sec:org621e065}

Le code qui nous permet de gérer la fenêtre SDL est disponible \href{render.c}{ici}.

\subsection{Début}
\label{sec:orgaa267a8}

Pour démarrer SDL, nous devons initialiser de nombreuses variables, comme par exemple :

\begin{itemize}
\item La variable \emph{Stape}, qui nous permet de fermer SDL si elle est égale à 0,
\item \emph{size}, qui va nous permettre de gérer la taille de l'écran,
\item des variables permettant de garder un nombre d'image par seconde (fps) constant et agréable
\item des variables permettant de détecter où le curseur de la souris se trouve sur l'écran
\item les varibles permettant de dessiner le graphique
\item etc.
\end{itemize}




\subsection{Affichage et fonctionnalité}
\label{sec:org173300b}
