Compterendu.org
*** Affichage

Pour effectuer l'affichage d'une fenêtre SDL, nous devons passer par une boucle /while/.

Puis, nous distinguerons trois cas grâce à un /if/ (et /else if/).

1. Dans le premier cas, SDL dessinera l'écran, s'il n'a pas été dessiné depuis un certain temps
2. Sinon, nous vérifierons également si les courbes sont en adéquation avec les polynômes. Si ce n'est pas le cas, nous entrons alors dans le /else if/ qui va nous permettre d'écraser l'image précédente. Enfin,
3. si nous passons les deux conditions précédentes, nous devons *absolument* endormir le Central Processing Unit (CPU). Cela nous permet de ne pas utiliser tout le processeur de l'ordinateur.

Puis, nous avons aussi un cas de débogage. En effet, si l'on n'est pas entré dans le while depuis une seconde ou plus, il peut y avoir un problème. On recommence alors une seconde "propre", en mettant certaines variables à 0.








*** Fonctionnalités :

Divers fonctionnalités sont présentes :
Vous pouvez afficher la fenêtre grâce à la touche "g". Vous pouvez désormais voir la liste des points, les courbes représentant l'interpolation lagrangienne et newtonienne, ainsi que la liste de points à droite.

De plus, si jamais vous voulez rajouter des points à la liste, cette fonctionnalité est disponible grâce au bouton gauche de la souris. Le bouton droit aura pour effet de supprimer le point sélectionné.

Le curseur aura alors une position (x et y) qui sera automatiquement ajouté dans la liste des points. Les courbes ainsi que les polynômes vont s'adapter automatiquement !


Enfin, vous pouvez zoomer et dézoomer grâce à la molette de la souris.


** Fin de SDL

La fonction /end-sdl/ nous permet de fermet la fenêtre SDL proprement, ainsi que faire les opérations nécessaires pour vider la mémoire qui a besoin d'être libéré.

* Conclusion sur les méthodes

** Site cool : [[https://math-linux.com/mathematiques/interpolation/article/interpolation-polynomiale-de-type-newton-et-differences-divisees][ici]] :noexport: 

** Le reste :ignore:

Nous pourrions sûrement améliorer notre programme pour Newton : en effet, d'après la définition des différences divisées, lorsque l'on ajoute de nouveaux points, nous ne sommes pas obligés de recalculer l'ensemble des coefficients du polynôme.


En revanche, malgré la différence de programme et de méthode utilisé, les méthodes nous amènent au même résultat (hors approximation des calculs). En effet, les polynômes, grâce aux jeux de données, sont trés proches et passent par les différents points donnés (voir fenêtre graphique SDL).





* Annexes  :noexport: 

** Jeux de Test

*** Densité de l'eau

Les résultats obtenus pour Newton sont :

  1.00 +  -0.94*x^(1)  +   1.62*x^(2)  +  -1.21*x^(3)  +   0.53*x^(4)  +  -0.15*x^(5)  +   0.03*x^(6)  +  -0.00*x^(7)  +   0.00*x^(8)  +  -0.00*x^(9)  +   0.00*x^(10)  +  -0.00*x^(11)  +   0.00*x^(12)  +  -0.00*x^(13)  +   0.00*x^(14)  +  -0.00*x^(15)  +   0.00*x^(16)  +  -0.00*x^(17)  +   0.00*x^(18)  +  -0.00*x^(19)
  
Les résultats obtenus pour Lagrange sont :

  1.00 +  -0.94*x^(1)  +   1.62*x^(2)  +  -1.21*x^(3)  +   0.53*x^(4)  +  -0.15*x^(5)  +   0.03*x^(6)  +  -0.00*x^(7)  +   0.00*x^(8)  +  -0.00*x^(9)  +   0.00*x^(10)  +  -0.00*x^(11)  +   0.00*x^(12)  +  -0.00*x^(13)  +   0.00*x^(14)  +  -0.00*x^(15)  +   0.00*x^(16)  +  -0.00*x^(17)  +   0.00*x^(18)  +  -0.00*x^(19)  +   0.00*x^(20) 
  
*** S1


*** S2
*** S3
*** Dépenses mensuelle et revenu
